{
  "defaced.comment.chat": "-----Chat Messages-----",
  "defaced.chat.first_start_message": "Welcome to defaced 5! We have friendly Discord community to chat, offer help and support, and share pics and videos.",
  "defaced.chat.discord_link": "You're more than welcome to join us.§r\n",
  "defaced.chat.wiki": "Looking for an FAQ or other information about the modpack?",
  "defaced.chat.wiki_link": "Check out our Wiki.§r\n",
  "defaced.chat.last_start_message": "Thanks for playing! We hope you enjoy exploring the worlds of defaced!§r\n",
  
  "defaced.comment.commands": "-----Commands-----",
  "commands.defaced.config.current": "Current config entry: %s",
  "commands.defaced.config.updated": "Updated config entry: %s",
  "commands.defaced.developer.tips_generated": "Generated %d tips successfully.",

  "defaced.comment.ui": "-----User Interface Changes-----",
  "defaced.tip_heading": "Defaced Tip",
  "tipsmod.title.default": "Minecraft Tip",

  "defaced.comment.tooltips": "-----Missing Tooltips-----",
  "tooltip.waila.crop_growth": "Growth: ",
  "tooltip.waila.crop_mature": "Mature",
  "defaced.tooltip.how_get_jade": "This gemstone can be found in Jungle biomes.",
  "defaced.tooltip.backpack": "Contains 27 inventory slots and 1 upgrade slot.",
  "defaced.tooltip.iron_backpack": "Contains 27 inventory slots and 2 upgrade slots.",
  "defaced.tooltip.gold_backpack": "Contains 27 inventory slots and 3 upgrade slots.",
  "defaced.tooltip.diamond_backpack": "Contains 27 inventory slots and 5 upgrade slots.",
  "defaced.tooltip.netherite_backpack": "Contains 27 inventory slots and 7 upgrade slots.",

  "defaced.comment.entities": "-----Missing Entity Names-----",
  "entity.minecraft.villager.advancedperipherals.computer_scientist": "Computer Scientist",

  "defaced.comment.items": "-----Missing Item Names-----",
  "item.effortlessbuilding.randomizer_bag": "Randomizer Bag",
  "item.effortlessbuilding.golden_randomizer_bag": "Golden Randomizer Bag",
  "item.effortlessbuilding.diamond_randomizer_bag": "Diamond Randomizer Bag",
  "item.effortlessbuilding.reach_upgrade1": "Reach Upgrade 1",
  "item.effortlessbuilding.reach_upgrade2": "Reach Upgrade 2",
  "item.effortlessbuilding.reach_upgrade3": "Reach Upgrade 3",

  "defaced.comment.blocks": "-----Missing Block Names-----",
  "block.trolldom.air_shrine": "Air Shrine",
  "block.trolldom.earth_shrine": "Earth Shrine",
  "block.trolldom.fire_shrine": "Fire Shrine",
  "block.trolldom.water_shrine": "Water Shrine",
  "block.supplementaries.edelwood_stick": "Edelwood Stick",

  "defaced.comment.tips": "-----Entries for the Tips mod-----",
  "defaced.tip.abacus": "Need to measure the distance between two blocks? Craft an Abacus to help!",
  "defaced.tip.carryon": "You can pick up many mobs and blocks by sneaking and right-clicking with both hands empty.",
  "defaced.tip.trowel": "The Trowel will place a random block from your hotbar when used, making it great for building with block variations!",
  "defaced.tip.snail": "You can find snails in autumnal biomes, and they love all things mushroom!",
  "defaced.tip.natures_compass": "Searching for a specific biome? Craft a Nature's Compass to find it!",
  "defaced.tip.cardboard_box": "Want to move things such as spawners over a long distance? Box it up in a cardboard box for easy transport.",
  "defaced.tip.tetra": "Craft a hammer from the Tetra mod and use it on a spare Crafting Table to start modifying your tools.",
  "defaced.tip.heat_generator": "A Heat Generator surrounded by lava is a very cheap passive energy source. You can also lava-log the generator itself!",
  "defaced.tip.minecolonies_start": "If you're interested in starting MineColonies, search around for a large flat biome such as Plains for an easier time building.",
  "defaced.tip.xp_bottling": "Want to store experience levels easily? Right-click on an Enchanting Table with a Glass Bottle!",
  "defaced.tip.black_hole": "A Black Hole can convert experience orbs into item form - great for a mob farm.",
  "defaced.tip.tea": "Fancy a cup of tea? Try searching for a Swamp biome for the seeds.",
  "defaced.tip.coffee": "Looking for a caffeine hit? Coffee beans grow naturally in Basalt Deltas in the Nether, and only grow on Basalt.",
  "defaced.tip.chisel": "A chisel can make interesting new variants of most vanilla Minecraft blocks.",
  "defaced.tip.effortless_building": "Build faster with Effortless Building! Hold Left-Alt (default keybind) to select a mode.",
  "defaced.tip.locked_drawers": "Holding a Drawer Key in your offhand while placing Storage Drawers will automatically lock them.",
  "defaced.tip.chairs": "Sitting in a chair? A comparator can detect that! Too lazy to stand up? Send a redstone signal to the chair!",
  "defaced.tip.flute": "A Flute will summon your pets directly to you.",
  "defaced.tip.compass_sign_post": "Using a Compass on a Sign Post will cause the Sign Post to face the direction the Compass is pointing in.",
  "defaced.tip.quantum_catcher": "A Quantum Catcher can capture most mobs inside, making them easy to transport.",
  "defaced.tip.ender_pearl_dispenser": "Have you ever wondered what would happen if a Dispenser fires an Ender Pearl? Try it!",
  "defaced.tip.bundle": "Bundles are great to craft early on to keep your inventory clear.",
  "defaced.tip.quiver": "You can use a Quiver to store multiple stacks of arrows in one slot, and switch between which ones to fire.",
  "defaced.tip.zombie_variants": "Zombie variants have a chance to drop modded ingots when killed by a player.",
  "defaced.tip.wandering_traders": "Wandering Traders are well stocked with exotic items, including some unique ones.",
  "defaced.tip.koi": "Hostile mobs won't spawn when Koi fish are around. You'll feel serenity when close enough.",
  "defaced.tip.crow_taming": "Crows are particularly fond of pumpkin seeds, but wild ones won't take them directly by hand.",
  "defaced.tip.mob_trading": "You can trade with more creatures than pigmen, if you think a mob is friendly try giving them something.",
  "defaced.tip.creature_taming": "Many of the animals are tamable and have added functionality, including new vanilla mobs",
  "defaced.tip.slabfish": "Slabfish are the pugs of minecraft, they're weird looking creatures and you can put cute clothes on them.",
  "defaced.tip.stonelings": "Stonelings are shy rock like creatures in caves, to get the items they carry you have to sneak up on them.",
  "defaced.tip.creeper_variants": "Creepers will tend to adapt to their enviroment.",
  "defaced.tip.potion_bundles": "Have too many potions? Three similar potions can be bundled with string.",
  "defaced.tip.missing_recipe": "Is there a block or item missing a recipe? Let us know in the discord!",
  "defaced.tip.armourers_workshop": "Want to make your armor and weapons look perfect? Armourers Workshop allows you to create it in a single player world block by block!"
}